{
    "About": "Sobre mi",
    "Skills":"Habilidades",
    "Work":"Trabajo",
    "My_work":"Mis trabajos",
    "Contact":"Contacto",
    "Intro_para_phrase_Sha":"Soy Shania, o simplemente Sha",
    "Intro_para_phrase_webdev":"desarrolladora web",
    "Intro_para_first" : "Apasionada por el aprendizaje de idiomas e interesada en el desarrollo web y las nuevas tecnologías, siempre he querido combinar estos campos",
    "Intro_para_second": "Tras completar una Licenciatura en Sistemas de Información y Ciencia de los Servicios en la Universidad de Ginebra y una formación de Desarrolladora Web en OpenClassrooms, este año comienzo un Máster en Procesamiento Informático Multilingüe para perfeccionar mis habilidades y crear soluciones adaptadas a un público internacional.",
    "Download_resume": "Descarga mi currículum",
    "Download_resume_here" :"aquí",
    "Tools":"Herramientas",
    "Backend":"Backend",
    "Frontend":"Frontend",
    "See_more":"Ver más",
    "See_code":"Ver código",
    "Booki_description":"El objetivo del sitio web es permitir a los usuarios encontrar alojamiento y actividades en la ciudad de su elección.",
    "Problem_title":"Problema",
    "Booki_problem_description":"La interfaz debe ser usable en una amplia gama de dispositivos, desde pantallas pequeñas hasta pantallas más grandes.",
    "Solution_title":"Solución",
    "Booki_solution_description":"Utilicé consultas de medios para adaptar los componentes de la interfaz a diferentes dispositivos. También probé la interfaz en varios dispositivos y emuladores para garantizar una experiencia de usuario fluida y flexible.",
    "Booki_skill_description":"Al trabajar en este proyecto, desarrollé habilidades esenciales en diseño responsivo, asegurando que la página funcione bien en todos los dispositivos y tamaños de pantalla.",
    "Nina_description":"Como parte de este proyecto, optimicé el SEO del sitio mejorando su rendimiento y accesibilidad",
    "Nina_problem_description":"El sitio web tiene un tiempo de carga largo, lo que impacta negativamente en la experiencia del usuario. No cumple con los estándares de accesibilidad, lo que dificulta la navegación para las personas con discapacidades visuales. Además, tiene un bajo ranking en los motores de búsqueda, lo que limita su visibilidad.",
    "Nina_solution_description":"Para abordar estos problemas, comprimí las imágenes y utilicé formatos modernos (como WebP) para reducir su tamaño sin una pérdida significativa de calidad. Modifiqué los scripts de JavaScript para cargarlos de manera asíncrona o diferida. Ajusté los colores del texto y del fondo para cumplir con los ratios de contraste recomendados, asegurando una mejor legibilidad para las personas con discapacidades visuales. Revisé la jerarquía de las etiquetas de encabezado para estructurar correctamente el contenido y mejorar la comprensión por parte de los motores de búsqueda. Además, utilicé Lighthouse y WAVE para evaluar el rendimiento actual del sitio y su accesibilidad.",
    "Nina_skill_description":"Al trabajar en este proyecto, desarrollé habilidades en optimización para motores de búsqueda (SEO) y accesibilidad.",
    "Kasa_description":"Kasa es una empresa que alquila apartamentos entre particulares. En este proyecto, implementé el front-end del sitio utilizando React y React Router.",
    "Kasa_problem_description":"Problemas relacionados con errores de navegación, redirecciones incorrectas o páginas 404 al navegar por las diferentes secciones del sitio.",
    "Kasa_solution_description":"Revisé y corregí la configuración de las rutas para asegurarme de que se mapeen correctamente a los componentes y gestionen adecuadamente los parámetros de la URL.",
    "Kasa_skill_description":"Desarrollé habilidades en React y React Router, y también aprendí a usar SASS.",
    "Grimoire_description":"Como parte de este proyecto, desarrollé el back-end de un sitio de calificación de libros. Mi objetivo fue crear un servidor utilizando Express y conectarlo a una base de datos MongoDB.",
    "Grimoire_problem_description":"Gestión eficaz de las cargas de imágenes y optimización para minimizar el impacto en el rendimiento del sitio. Algunas rutas en la aplicación no funcionan correctamente porque no están definidas en el orden correcto, lo que lleva a conflictos y errores de enrutamiento.",
    "Grimoire_solution_description":"Usé Multer para gestionar las cargas de archivos, configurando opciones de almacenamiento y gestión de archivos. También utilicé bibliotecas como Sharp para optimizar las imágenes cargadas, reduciendo su tamaño sin comprometer la calidad. En cuanto a las rutas, revisé el orden de las definiciones de rutas para asegurar que las rutas específicas estén definidas antes que las rutas generales.",
    "Grimoire_skill_description":"Desarrollé habilidades en el desarrollo backend, particularmente con Node.js, Express y MongoDB. Estas habilidades incluyen la creación y gestión de servidores, la conexión y manipulación de bases de datos, la configuración de modelos de datos, la realización de operaciones CRUD y la implementación de sistemas de autenticación y seguridad de datos.",
    "Thank_you":"¡Gracias por visitar mi portfolio! Estoy agradecida por tu tiempo e interés. Si tienes algún comentario o deseas discutir oportunidades potenciales, no dudes en ponerte en contacto.",
    "Quote":"Todos llegamos a un punto en nuestra vida en el que queremos rendirnos. Pero es lo que haces en ese momento es lo que define quién eres."
  }