{
    "About": "About",
    "Skills":"Skills",
    "Work":"Work",
    "My_work":"My work",
    "Contact":"Contact",
    "Intro_para_phrase_Sha":"I'm Shania, or just Sha",
    "Intro_para_phrase_webdev":"web developer",
    "Intro_para_first" : "Passionate about learning foreign languages and interested in web development and new technologies, I have always wanted to combine these fields",
    "Intro_para_second": "After completing a Bachelor’s in Information Systems and Service Science at the University of Geneva and a Web Developer training course at OpenClassrooms, I’m starting a Master’s in Multilingual Communication Technology this year to enhance my skills and build solutions for a diverse global audience.",
    "Download_resume": "Download my resume",
    "Download_resume_here" :"here",
    "Tools":"Tools",
    "Backend":"Backend",
    "Frontend":"Frontend",
    "See_more":"See more",
    "See_code":"See code",
    "Booki_description":"The website's goal is to allow users to find accommodation and activities in the city of their choice",
    "Problem_title":"Problem",
    "Booki_problem_description":"The interface must be usable across a wide range of devices, from small screens to larger ones.",
    "Solution_title":"Solution",
    "Booki_solution_description":"I used media queries to adapt the interface components to different devices. I also tested the interface on various devices and emulators to ensure a smooth and flexible user experience",
    "Booki_skill_description":"By working on this project, I developped essential skills in responsive design, ensuring that the page functions well on all devices and screen sizes",
    "Nina_description":"As part of this project, I optimized the site's SEO by improving its performance and accessibility.",
    "Nina_problem_description":"The website has a long loading time, which negatively impacts user experience. It does not adhere to accessibility standards, making navigation challenging for individuals with visual impairments. Additionally, it has a low ranking in search engines, which limits its visibility.",
    "Nina_solution_description":"To address these issues, I compressed the images and used modern formats (such as WebP) to reduce their size without significant loss of quality. I modified JavaScript scripts to load them asynchronously or defer their loading. I adjusted text and background colors to meet recommended contrast ratios, ensuring better readability for visually impaired individuals. I reviewed the hierarchy of heading tags to properly structure the content and improve search engine comprehension. Additionally, I used Lighthouse and WAVE to assess the site's current performance and accessibility.",
    "Nina_skill_description":"By working on this project, I developed skills in earch engine optimization (SEO) and accessibility",
    "Kasa_description":"Kasa is a company that rents apartments between individuals. In this project, I implemented the front-end of the site using React and React Router",
    "Kasa_problem_description":"Issues related to navigation errors, incorrect redirections, or 404 pages when navigating through different sections of the site",
    "Kasa_solution_description":"I reviewed and corrected the route configuration to ensure that it correctly maps to the components and manages the URL parameters properly",
    "Kasa_skill_description":"I developed skills in React and React Router, and I also learned how to use SASS",
    "Grimoire_description":"As part of this project, I developed the back-end of a book rating site. My goal was to create a server using Express and connect it to a MongoDB database.",
    "Grimoire_problem_description":"Effective management of image uploads and optimization to minimize the impact on site performance. Some routes in the application do not work correctly because they are not defined in the correct order, leading to conflicts and routing errors.",
    "Grimoire_solution_description":"I used Multer to handle file uploads, configuring storage options and file management. I also used libraries like Sharp to optimize uploaded images by reducing their size without compromising quality. Regarding routes, I reviewed the order of route definitions to ensure that specific routes are defined before general routes.",
    "Grimoire_skill_description":"I developed skills in backend development, particularly with Node.js, Express, and MongoDB. These skills include creating and managing servers, connecting to and manipulating databases, setting up data models, performing CRUD operations, and implementing authentication and data security systems.",
    "Thank_you":"Thank you for visiting my portfolio! I’m grateful for your time and interest. If you have any feedback or would like to discuss potential opportunities, please feel free to reach out.",
    "Quote":"Everybody comes to a point in their life when they want to quit. But it's what you do at that moment that determines who you are"
  }