{
    "About": "나에 대한",
    "Skills":"재주",
    "Work":"노력",
    "My_work":"내 작업",
    "Contact":"연락처",
    "Intro_para_phrase_Sha":"저는 샤니아입니다, 아니면 그냥 샤",
    "Intro_para_phrase_webdev":"웹 개발자",
    "Intro_para_first" : "외국어를 배우는 것에 열정을 가지고 있으며, 웹 개발과 새로운 기술에 관심이 많은 저는 이 두 분야를 결합하고 싶어했습니다.",
    "Intro_para_second": "다양한 문화와 언어에 맞춘 도구를 개발함으로써, 모든 문화적 배경을 가진 사람들을 돕고자 합니다.",
    "Download_resume": "이력서를 다운로드하세요",
    "Download_resume_here" :"여기",
    "Tools":"연장",
    "Backend":"백엔드",
    "Frontend":"프론트엔드",
    "See_more":"더 보기",
    "See_code":"코드 보기",
    "Booki_description":"이 웹사이트의 목표는 사용자가 선택한 도시에서 숙소와 활동을 찾을 수 있도록 하는 것입니다.",
    "Problem_title":"문제",
    "Booki_problem_description":"인터페이스는 작은 화면에서 큰 화면까지 다양한 장치에서 사용 가능해야 합니다.",
    "Solution_title":"해결책",
    "Booki_solution_description":"미디어 쿼리를 사용하여 인터페이스 컴포넌트를 다양한 장치에 맞게 조정했습니다. 또한, 다양한 장치와 에뮬레이터에서 인터페이스를 테스트하여 매끄럽고 유연한 사용자 경험을 보장했습니다.",
    "Booki_skill_description":"이 프로젝트를 진행하면서 반응형 디자인에 대한 필수 기술을 개발했습니다. 이를 통해 페이지가 모든 장치와 화면 크기에서 잘 작동하도록 보장했습니다.",
    "Nina_description":"이 프로젝트의 일환으로 사이트의 SEO를 최적화하여 성능과 접근성을 향상시켰습니다.",
    "Nina_problem_description":"웹사이트의 로딩 시간이 길어져 사용자 경험에 부정적인 영향을 미칩니다. 접근성 기준을 준수하지 않아 시각 장애가 있는 개인들이 탐색하기 어렵습니다. 또한 검색 엔진에서 순위가 낮아 가시성이 제한됩니다.",
    "Nina_solution_description":"이 문제를 해결하기 위해, 이미지를 압축하고 최신 형식(예: WebP)을 사용하여 품질의 큰 손실 없이 파일 크기를 줄였습니다. JavaScript 스크립트를 수정하여 비동기적으로 로드하거나 로딩을 지연시켰습니다. 텍스트와 배경 색상을 조정하여 권장 대비 비율을 충족시켜 시각 장애가 있는 개인들이 더 잘 읽을 수 있도록 했습니다. 제목 태그의 계층 구조를 검토하여 콘텐츠를 올바르게 구조화하고 검색 엔진의 이해를 개선했습니다. 또한, Lighthouse와 WAVE를 사용하여 사이트의 현재 성능과 접근성을 평가했습니다.",
    "Nina_skill_description":"이 프로젝트를 진행하면서, 검색 엔진 최적화(SEO)와 접근성 관련 기술을 개발했습니다.",
    "Kasa_description":"Kasa는 개인 간의 아파트를 임대하는 회사입니다. 이 프로젝트에서 저는 React와 React Router를 사용하여 사이트의 프론트엔드를 구현했습니다.",
    "Kasa_problem_description":"사이트의 다양한 섹션을 탐색할 때 내비게이션 오류, 잘못된 리디렉션 또는 404 페이지와 관련된 문제들",
    "Kasa_solution_description":"저는 경로 구성을 검토하고 수정하여 올바르게 컴포넌트에 매핑되도록 하고 URL 매개변수를 제대로 관리하도록 했습니다.",
    "Kasa_skill_description":"저는 React와 React Router에서 기술을 개발했으며, SASS 사용 방법도 배웠습니다.",
    "Grimoire_description":"이 프로젝트의 일환으로, 저는 책 평점 사이트의 백엔드를 개발했습니다. 제 목표는 Express를 사용하여 서버를 생성하고, MongoDB 데이터베이스에 연결하는 것이었습니다.",
    "Grimoire_problem_description":"이미지 업로드의 효율적인 관리와 최적화를 통해 사이트 성능에 미치는 영향을 최소화했습니다. 일부 애플리케이션의 경로는 올바른 순서로 정의되지 않아 충돌 및 라우팅 오류가 발생합니다.",
    "Grimoire_solution_description":"파일 업로드를 처리하기 위해 Multer를 사용하여 저장 옵션과 파일 관리를 설정했습니다. 또한 Sharp와 같은 라이브러리를 사용하여 업로드된 이미지를 최적화하고 품질을 손상시키지 않으면서 크기를 줄였습니다. 경로와 관련해서는, 특정 경로가 일반 경로보다 먼저 정의되도록 경로 정의의 순서를 검토했습니다.",
    "Grimoire_skill_description":"저는 백엔드 개발에서 특히 Node.js, Express, MongoDB를 활용하여 기술을 개발했습니다. 이러한 기술에는 서버 생성 및 관리, 데이터베이스 연결 및 조작, 데이터 모델 설정, CRUD 작업 수행, 인증 및 데이터 보안 시스템 구현이 포함됩니다.",
    "Thank_you":"제 포트폴리오를 방문해 주셔서 감사합니다! 시간을 내어 주시고 관심을 가져 주셔서 감사드립니다. 피드백이 있으시거나 잠재적인 기회에 대해 논의하고 싶으시다면, 언제든지 연락 주시기 바랍니다.",
    "Quote":"모두가 인생에서 포기하고 싶은 순간을 맞이합니다. 하지만 그 순간에 당신이 무엇을 하느냐가 당신을 결정짓습니다."
  }