{
    "About": "À propos",
    "Skills":"Compétences",
    "Work":"Travaux",
    "Contact":"Contact",
    "My_work":"Mes travaux",
    "Intro_para_phrase_Sha":"Je suis Shania ou Sha tout simplement",
    "Intro_para_phrase_webdev":"développeuse web",
    "Intro_para_first" : "Passionnée par l'apprentissage des langues étrangères et intéressée par le développement web et les nouvelles technologies, j'ai toujours eu pour ambition de marier ces deux domaines.",
    "Intro_para_second": "Après un Bachelor en Systèmes d'Information et Science des Services à l’Université de Genève et une formation de Développeur Web chez OpenClassrooms, je débute cette année un Master en Traitement Informatique Multilingue pour perfectionner mes compétences et créer des solutions adaptées à un public international.",
    "Download_resume": "Télecharge mon CV",
    "Download_resume_here" :"ici",
    "Tools":"Outils",
    "Backend":"Backend",
    "Frontend":"Frontend",
    "See_more":"Voir plus",
    "See_code":"Voir code",
    "Booki_description":"Le but du site est de permettre aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
    "Problem_title":"Problématique",
    "Booki_problem_description":"L'interface du site doit être utilisable sur une large gamme de dispositifs, allant des petits écrans de smartphones aux grands écrans de bureau.",
    "Solution_title":"Solution",
    "Booki_solution_description":"J’ai utilisé des techniques de media queries pour adapter les composants de l'interface aux différentes tailles d'écran. J'ai également testé l'interface sur divers appareils physiques et émulateurs pour garantir une expérience utilisateur cohérente et fluide.",
    "Booki_skill_description":"En travaillant sur ce projet, j’ai développé des compétences essentielles en design responsive, assurant que la page d'accueil fonctionne bien sur tous les appareils et toutes les tailles d'écran.",
    "Nina_description":"Dans le cadre de ce projet, j’ai optimisé le référencement du site, en améliorant sa performance et son accessibilité.",
    "Nina_problem_description":"Le temps de chargement du site est long, ce qui entraîne mauvaise expérience utilisateur. Le site ne respecte pas les standards d'accessibilité, rendant la navigation difficile pour les personnes ayant des handicaps visuels. Le site a un faible classement dans les moteurs de recherche, ce qui limite sa visibilité.",
    "Nina_solution_description":"Pour pallier à tout cela, j’ai compressé les images, utilisé des formats modernes (comme WebP) pour réduire leur taille sans perte significative de qualité, modifié les scripts JavaScript pour les charger de manière asynchrone ou différée, modifié les couleurs de texte et de fond pour respecter les ratios de contraste recommandés, assurant ainsi une meilleure lisibilité pour les personnes malvoyantes, révisé la hiérarchie des balises de titre pour structurer correctement le contenu et améliorer la compréhension du contenu par les moteurs de recherche et utilisé Lighthouse et Wave pour évaluer les performances actuelles du site et son accessibilité.",
    "Nina_skill_description":"En travaillant sur ce projet, j’ai développé des compétences optimisation du référencement (SEO) et accessibilité.",
    "Kasa_description":"Kasa est une entreprise de location d’appartements entre particuliers. Dans ce projet, j’ai implémenté le front-end du site en utilisant React et React Router.",
    "Kasa_problem_description":"Des problèmes liés aux erreurs de navigation, des redirections incorrectes ou des pages 404 lorsqu'on navigue entre les différentes sections de l'application.",
    "Kasa_solution_description":"J’ai revu et corrigé la configuration des routes pour s'assurer qu'elles correspondent aux composants adéquats et qu'elles gèrent correctement les paramètres d'URL.",
    "Kasa_skill_description":"J’ai développé des compétences en react et react router. J’ai également appris à utiliser SASS.",
    "Grimoire_description":"Dans le cadre de ce projet, j’ai developpé le back-end d'un site de notation de livres. Mon objectif a été de créer un serveur avec Express et de le connecter à une base de données MongoDB.",
    "Grimoire_problem_description":"Gestion efficace des téléchargements d'images et optimisation pour minimiser l'impact sur les performances du site. Certaines routes de l'application ne fonctionnent pas correctement car elles ne sont pas définies dans le bon ordre, entraînant des conflits et des erreurs de routage.",
    "Grimoire_solution_description":"J’ai utilisé Multer pour gérer les téléchargements de fichiers, en configurant les options de stockage et de gestion des fichiers. J’ai aussi utilisé des bibliothèques comme Sharp pour optimiser les images téléchargées, en réduisant leur taille sans compromettre la qualité.En ce qui concerne les routes, j’ai revu l'ordre des définitions de routes pour s'assurer que les routes spécifiques sont définies avant les routes générales.",
    "Grimoire_skill_description":"J’ai développé des compétences en développement backend, en particulier avec Node.js, express et MongoDB. Ces compétences incluent la création et la gestion de serveurs, la connexion et la manipulation de bases de données, la mise en place de modèles de données, la réalisation d'opérations CRUD, ainsi que la mise en œuvre de systèmes d'authentification et de sécurité des données.",
    "Thank_you":"Merci de visiter mon portfolio ! Je suis reconnaissante pour votre temps et votre intérêt. Si vous avez des retours ou souhaitez discuter de potentielles opportunités, n'hésitez pas à me contacter.",
    "Quote":"Tout le monde arrive à un moment dans sa vie où il a envie d'abandonner. Mais c'est ce que vous faites à ce moment-là qui détermine qui vous êtes."
  }